Autodesk.Revit.DB.Structure.RebarSpliceUtils.TransferAnnotationsBetweenRebars(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},System.Boolean,System.Boolean)
Gets the annotations ( tags and dimensions ) from the source rebars and set for them a new host on destination rebars.
sourceRebarIds:
The ids of the source Rebar elements.
destinationRebarIds:
The ids of the destination Rebar elements.
transferOnTheSameIndex:
It will be set to true when annotations are transferred between rebars at the same index and false when will identify the closest available index for transferring the annotation.
transferMRA:
It will be set to true when dimensions are transferred between rebars without mra dimenstion, and false when will transfer all dimenstion.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.GetLapDirectionForSpliceGeometryAndPosition(Autodesk.Revit.DB.Structure.Rebar,Autodesk.Revit.DB.Structure.RebarSpliceGeometry,Autodesk.Revit.DB.Structure.RebarSplicePosition)
This function calculates the lap direction given a RebarSpliceGeometry and a RebarSplicePosition.
Remarks:
This function determines first the point where the RebarSpliceGeometry will cut the rebar.
Based on the RebarSplicePosition value it will determine the direction where the lap will go, RebarSplicePosition.End1 meaning towards the start of the splice chain and RebarSplicePosition.End2 towards the end.
For more information about the splice chain concept please check Autodesk.Revit.DB.Structure.RebarSpliceUtils.GetSpliceChain(Rebar rebar).
This function will throw exception if it's called with RebarSplicePosition.Middle.
rebar:
The input rebar.
spliceGeometry:
The splice geometry.
splicePosition:
The splice position.
Returns:
The lap direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
RebarSplicePosition should not be Middle.
-or-
Free Form Rebars other than Morphed, or Shape Driven Rebars that are Multiplanar or have a shape whose definition is RebarShapeDefinitionByArc can't be spliced.
Also, if the Rebar is member of a Group it cannot be spliced.
-or-
The rebar cannot be spliced with the provided RebarSpliceGeometry.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.GetSpliceChain(Autodesk.Revit.DB.Structure.Rebar)
Returns all the rebars that are part of a splice chain with the input rebar.
Remarks:
The elements in the output list are in exactly in the same order as they are connected.
For Shape Driven Rebar, the first element in the array is the one whose Rebar Plane, Out of Plane Extent and Edge are not constrained to a rebar from the chain
Second is constrained to first, third to second and so on.
For Free Form Rebar there are no RebarConstraints between sets. They are just listed in the order where the first is having lap with second, the second
is having a lap with the third and so on.
The output list will also contain the input rebar id.
If the rebar is not in a splice chain the returned list will contain just one element which is the id of the input rebar.
rebar:
The input rebar.
Returns:
Returns all the rebars that are part of a splice chain with the input rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.CanRebarBeSpliced(Autodesk.Revit.DB.Structure.Rebar,Autodesk.Revit.DB.Structure.RebarSpliceOptions,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.XYZ)
Verifies if the rebar can be spliced with the provided line.
Remarks:
If the provided linePlaneNormal is parallel with the bar plane normal the bounded line will be used to calculate the splice geometries where the bar will be spliced.
Otherwise, the line will be extended to exceed the bounding box of the bar.
rebar:
The rebar to be spliced.
spliceOptions:
The RebarSpliceOptions.
line:
The line to splice the rebar with.
linePlaneNormal:
The normal that determines the plane of the line.
Returns:
Will return RebarSpliceError.Success if it's possible to splice with line or other enum value corresponding to the error that occurred.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.CanRebarBeSpliced(Autodesk.Revit.DB.Structure.Rebar,Autodesk.Revit.DB.Structure.RebarSpliceOptions,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.ElementId)
Verifies if the rebar can be spliced with the provided line.
Remarks:
This method uses the view normal in case of a 2D view and the current workplane normal in case of a 3D view.
If the view normal is parallel with the bar plane normal the bounded line will be used to calculate the splice geometries where the bar will be splice.
Otherwise, the line will be extended to exceed the bounding box of the bar.
rebar:
The rebar to be spliced.
spliceOptions:
The RebarSpliceOptions.
line:
The line to splice the rebar with.
viewId:
Based on the view it will be determined the plane of the line.
Returns:
Will return RebarSpliceError.Success if it's possible to splice with line or other enum value corresponding to the error that occurred.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.SpliceRebar(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarSpliceOptions,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.XYZ)
Splice a rebar with a line.
Remarks:
If the provided linePlaneNormal is parallel with the bar plane normal the bounded line will be used to calculate the splice geometries where the bar will be splice.
Otherwise, the line will be extended to exceed the bounding box of the bar.
document:
The document
rebarIdToSplice:
Rebar id to splice.
spliceOptions:
The rebar splice options.
line:
The line used for splice.
linePlaneNormal:
The normal of the plane of the line.
Returns:
Returns the ids of the rebars that are considered to be spliced.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Free Form Rebars other than Morphed, or Shape Driven Rebars that are Multiplanar or have a shape whose definition is RebarShapeDefinitionByArc can't be spliced.
Also, if the Rebar is member of a Group it cannot be spliced.
-or-
The rebar cannot be spliced with the provided line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.SpliceRebar(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarSpliceOptions,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.ElementId)
Splice a Rebar with a line.
Remarks:
This method uses the view normal in case of a 2D view and the current workplane normal in case of a 3D view.
If the view normal is parallel with the bar plane normal the bounded line will be used to calculate the splice geometries where the bar will be spliced.
Otherwise, the line will be extended to exceed the bounding box of the bar.
document:
The document
rebarIdToSplice:
Rebar id to splice.
spliceOptions:
The rebar splice options.
line:
The line used for splice.
viewId:
Based on the view it will be determined the plane of the line.
Returns:
Returns the ids of the rebars that are considered to be spliced.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Free Form Rebars other than Morphed, or Shape Driven Rebars that are Multiplanar or have a shape whose definition is RebarShapeDefinitionByArc can't be spliced.
Also, if the Rebar is member of a Group it cannot be spliced.
-or-
The rebar cannot be spliced with the provided line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.GetSpliceGeometries(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarSpliceOptions,Autodesk.Revit.DB.Structure.RebarSpliceRules)
Computes a list of RebarSpliceGeometry which respects the rules. This list can be used to splice the Rebar.
document:
The document
rebarIdToSplice:
Rebar id to splice.
spliceOptions:
The rebar splice options.
spliceRules:
The splice rules.
Returns:
Returns the result of the operation. If the operation was successful the RebarSpliceByRulesResult.Error member will have "RebarSpliceByRulesError.Success" value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
RebarSplicePosition should be Middle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.SpliceRebar(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarSpliceOptions,System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.RebarSpliceGeometry})
Splice a rebar with a list of RebarSpliceGeometry.
document:
The document
rebarIdToSplice:
Rebar id to splice.
spliceOptions:
The rebar splice options.
spliceGeometries:
A list of RebarSpliceGeometry that indicates where the rebar will be spliced.
Returns:
Returns the ids of the rebars that are considered to be spliced.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Free Form Rebars other than Morphed, or Shape Driven Rebars that are Multiplanar or have a shape whose definition is RebarShapeDefinitionByArc can't be spliced.
Also, if the Rebar is member of a Group it cannot be spliced.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025